7767517
83 91
Input                    in0                      0 1 in0
Convolution              conv_2                   1 1 in0 1 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=432
Swish                    silu_32                  1 1 1 2
Pooling                  maxpool2d_26             1 1 2 3 0=0 1=2 11=2 12=2 13=0 2=2 3=0 5=1
Convolution              conv_3                   1 1 3 4 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608
Swish                    silu_33                  1 1 4 5
Pooling                  maxpool2d_27             1 1 5 6 0=0 1=2 11=2 12=2 13=0 2=2 3=0 5=1
Convolution              conv_4                   1 1 6 7 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432
Swish                    silu_34                  1 1 7 8
Pooling                  maxpool2d_28             1 1 8 9 0=0 1=2 11=2 12=2 13=0 2=2 3=0 5=1
Convolution              conv_5                   1 1 9 10 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728
Swish                    silu_35                  1 1 10 11
Pooling                  maxpool2d_29             1 1 11 12 0=0 1=2 11=2 12=2 13=0 2=2 3=0 5=1
Convolution              conv_6                   1 1 12 13 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912
Swish                    silu_36                  1 1 13 14
Split                    splitncnn_0              1 2 14 15 16
Pooling                  maxpool2d_30             1 1 16 17 0=0 1=2 11=2 12=2 13=0 2=2 3=0 5=1
Convolution              conv_7                   1 1 17 18 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1179648
Swish                    silu_37                  1 1 18 19
Padding                  zeropad_52               1 1 19 20 0=0 1=1 2=0 3=1 4=0 5=0.000000e+00
Pooling                  maxpool2d_31             1 1 20 21 0=0 1=2 11=2 12=1 13=0 2=1 3=0 5=1
Convolution              conv_8                   1 1 21 22 0=1024 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4718592
Swish                    silu_38                  1 1 22 23
Convolution              conv_9                   1 1 23 24 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Swish                    silu_39                  1 1 24 25
Split                    splitncnn_1              1 2 25 26 27
Convolution              conv_10                  1 1 27 28 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1179648
Swish                    silu_40                  1 1 28 29
Split                    splitncnn_2              1 2 29 30 31
Convolution              conv_11                  1 1 26 32 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_41                  1 1 32 33
Interp                   upsample_51              1 1 33 34 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_0                    2 1 34 15 35 0=0
Convolution              conv_12                  1 1 35 36 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=884736
Swish                    silu_42                  1 1 36 37
Split                    splitncnn_3              1 2 37 38 39
MemoryData               pnnx_3                   0 1 40 0=2000
Convolution              conv_13                  1 1 39 41 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_43                  1 1 41 42
Convolution              conv_14                  1 1 42 43 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_44                  1 1 43 44
Convolution              conv_15                  1 1 44 45 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Convolution              conv_16                  1 1 38 46 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Swish                    silu_45                  1 1 46 47
Convolution              conv_17                  1 1 47 48 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Swish                    silu_46                  1 1 48 49
Convolution              conv_18                  1 1 49 50 0=80 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=20480
Concat                   cat_1                    2 1 45 50 51 0=0
Convolution              conv_19                  1 1 31 52 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912
Swish                    silu_47                  1 1 52 53
Convolution              conv_20                  1 1 53 54 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_48                  1 1 54 55
Convolution              conv_21                  1 1 55 56 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Convolution              conv_22                  1 1 30 57 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1179648
Swish                    silu_49                  1 1 57 58
Convolution              conv_23                  1 1 58 59 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Swish                    silu_50                  1 1 59 60
Convolution              conv_24                  1 1 60 61 0=80 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=20480
Concat                   cat_2                    2 1 56 61 62 0=0
Reshape                  view_54                  1 1 51 63 0=1600 1=144
Reshape                  view_55                  1 1 62 64 0=400 1=144
Concat                   cat_3                    2 1 63 64 65 0=1
Slice                    split_0                  1 2 65 66 67 -23300=2,64,80 1=0
Reshape                  view_56                  1 1 66 68 0=2000 1=16 2=4
Permute                  transpose_58             1 1 68 69 0=2
Softmax                  softmax_1                1 1 69 70 0=0 1=1
Convolution              conv_25                  1 1 70 71 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=16
Reshape                  view_57                  1 1 71 72 0=2000 1=4
MemoryData               pnnx_fold_anchor_points.1 0 1 73 0=2000 1=2
MemoryData               pnnx_fold_anchor_points.1_1 0 1 74 0=2000 1=2
Slice                    chunk_0                  1 2 72 75 76 -23300=2,-233,-233 1=0
BinaryOp                 sub_0                    2 1 73 75 77 0=1
Split                    splitncnn_4              1 2 77 78 79
BinaryOp                 add_1                    2 1 74 76 80 0=0
Split                    splitncnn_5              1 2 80 81 82
BinaryOp                 add_2                    2 1 78 81 83 0=0
BinaryOp                 div_3                    1 1 83 84 0=3 1=1 2=2.000000e+00
BinaryOp                 sub_4                    2 1 82 79 85 0=1
Concat                   cat_4                    2 1 84 85 86 0=0
Reshape                  reshape_53               1 1 40 87 0=2000 1=1
BinaryOp                 mul_5                    2 1 86 87 88 0=2
Sigmoid                  sigmoid_0                1 1 67 89
Concat                   cat_5                    2 1 88 89 out0 0=0
